Repository: rnr1721/le7-framework
Catalog: App/Locales/*/LC_MESSAGES/le7_*.po
Languages: ru_ru, uk_ua

source: This variable can not be used in this place:
ru_ru: Переменная не может быть использована в этом месте:
uk_ua: Ця змінна не може бути використана у цьому місьці

source: Allowed engines:
uk_ua: Дозволені движки:

source: Folder not exists
ru_ru: Каталог не существует
uk_ua: Директорія не існує

source: File exists:
ru_ru: Файл существует:
uk_ua: Файл існує:

source: Required parameter missing:
ru_ru: Отсутствует необходимый параметр:
uk_ua: Необїідний параметр відсутній:

source: Empty date in processDate
ru_ru: Пустая дата в processDate
uk_ua: Порожня дата у processDate

source: Param in router not found
ru_ru: Параметр в маршруте не найден
uk_ua: Параметр у роутері не знайдено

source: Invalid method, need
ru_ru: Неправильный метод, нужен
uk_ua: Неправильний метод, повинен бути

source: Need header:
ru_ru: Необходим заголовок:
uk_ua: Необхідний заголовок:

source: You need to fill these field:
ru_ru: Вам необходимо наличие этого поля:
uk_ua: Вам необхідно заповнити це поле:

source: Response
ru_ru: Ответ
uk_ua: Ответ

source: Errors
ru_ru: Ошибки
uk_ua: Ошибки

source: Fatal Error
ru_ru: Фатальная ошибка
uk_ua: Фатальна помилка

source: Page not found
ru_ru: Страница не найдена
uk_ua: Сторінка не знайдена

source: Method not allowed
ru_ru: Метод не позволен
uk_ua: Метод не дозволено

source: Are your thoughts impure?
ru_ru: Ваши мысли чисты?
uk_ua: Ваші думки чисті?

source: Please take me home!
uk_ua: Буль ласка, заберіть мене додому!

source: Lame PHP engine placeholder page
ru_ru: Страница-заглушка Lame PHP engine
uk_ua: Базова сторінка Lame PHP engine

source: As long as you haven't created a main controller (IndexController by default) and an indexed master page (indexAction by default), this stub will be displayed.
ru_ru: Пока вы не создадите главный контроллер (IndexController по умолчанию) с индексной страницей (IndexAction по умолчанию), эта заглушка будет отображаться.
uk_ua: Доки ви не створите головний контролер (IndexController за замовчанням) та індексний екшн (indexAction за замовчанням), ця заглушка буде тут.

source: Routing
ru_ru: Роутинг
uk_ua: Маршрутизація

source: Pages are displayed as follows: https://site.com/en/page1. In the case of the main page of the site, if the default language is used, then it will not be displayed. For example, if the default language in the configuration file is Russian, then the address of the main page will be: https://site.com but if you need to display the page in another language, then the mainpage address will be https://site.com/es
ru_ru: Страницы будут показаны следующим образом: https://site.com/en/page1. В случае главной страницы веб-сайта, если используется язык по умолчанию, он не будет отображаться. Для примера, если язык по умолчанию в файле конфигурации указан Русский, адрес главной страницы будет: https://site.com но если вам необходимо отобразить главную страницу на другом языке, тогда адрес будет https ://site.com/es
uk_ua: Сторінки будуть показані як https://site.com/en/page1. У випадку головної сторінки сайту, коли активна мова за замовчанням, мова не буде показуватись. Для прикладу, коли мова за замовчанням вибрана як Російська у файлі конфігурації, адреса головної буде: https://site.com але якщо ви забажаєте показати сторінку іншою мовою, тоді головна буде https ://site.com/es

source: The address format is as follows: https://site.com/{LANG}/{CONTROLLER}/{ACTION}/{PARAMS}
ru_ru: Формат адресов выглядит следующим образом: https://site.com/{LANG}/{CONTROLLER}/{ACTION}/{PARAMS}
uk_ua: Формат адресу зазвичай такий: https://site.com/{LANG}/{CONTROLLER}/{ACTION}/{PARAMS}

source: Example of web controller for Smarty template engine
uk_ua: Приклад веб контролена з використанням SMARTY

source: file
ru_ru: файл
uk_ua: файл

source: route
ru_ru: маршрут
uk_ua: маршрут

source: In this example, the template ./App/Themes/Main/mytemplate.tpl (must be exists!) will be included in which there will be a Smarty variable {$myvar}
ru_ru: В этом примере, будет отрендерен шаблон ./App/Themes/Main/mytemplate.tpl (должен существовать!), а в шаблоне тамгде она указана, будет отображена переменная {$myvar}
uk_ua: У цьому прикладі, шаблон ./App/Themes/Main/mytemplate.tpl (повинен існувати!) у потрібному місці буде відображено змінну {$myvar} (повинна бути у шаблоні)

source: Example of web controller for clean Php template engine
ru_ru: Пример веб-контроллера для чистого вывода PHP
uk_ua: Приклад веб контролера з використанням чистого PHP виводу

source: routes
ru_ru: маршруты
uk_ua: маршрути

source: Stub page
ru_ru: Страница заглушка
